Repository: fikre211/visitor-management-system-main
Catalog: GatePass.*.ClientApp/Resources/Views/Home/Index.*.resx
Languages: am_et

source: All Registered Users
am_et: ሁሉም የተመዘገቡ ተጠቃሚዎች

source: allRequests
am_et: ሁሉም ጥያቄዎች

source: approvedRequests
am_et: የጸደቁ ጥያቄዎች

source: guestFullName
am_et: የእንግዳ ሙሉ ስም

source: pendingRequests
am_et: በመጠባበቅ ላይ ያሉ ጥያቄዎች

source: purposeOfVisit
am_et: የጉብኝት ዓላማ

source: responsiblePerson
am_et: ኃላፊነት ያለው ሰው

source: viewDetail
am_et: ዝርዝር ይመልከቱ

source: visitDateEnd
am_et: የመጎብኘት ቀን ማብቂያ

source: visitDateStart
am_et: ጉብኝት የሚጀመርበት ቀን

source: wellCome
am_et: እንኳን ደህና መጣህ

source: wellComeToMint
am_et: እንኳን ወደ ኢኖቬሽን እና ቴክኖሎጂ ሚኒስቴር በደህና መጡ

source: wellComeUser
am_et: እንኳን ደህና መጣህ

source: SelfRegistration
am_et: መመዝገቢያ

source: CheckIn
am_et: መግቢያ

source: CheckOut
am_et: መውጫ

source: Employees
am_et: ሰራተኞች

source: OutDated Requests
am_et: ጊዜ ያለፈባቸው ጥያቄዎች

source: Reviewed Requests
am_et: የተገመገሙ ጥያቄዎች

source: Visitors Overview
am_et: የጎብኝዎች አጠቃላይ እይታ

source: User Roles Distribution
am_et: የተጠቃሚ ሚናዎች ስርጭት

source: Requests Trend
am_et: የጥያቄዎች አዝማሚያ

source: New Request
am_et: አዲስ ጥያቄ

source: Name
am_et: ስም

source: Guest Destination Department
am_et: የእንግዳ ማረፊያ ክፍል

source: Print
am_et: አትም

source: Check-in Status
am_et: የመግቢያ ሁኔታ

source: Actions
am_et: ድርጊቶች

source: Quick Access
am_et: ፈጣን መዳረሻ

source: Scan the QR Code below for a swift Self-Registration
am_et: በፍጥነት ራስዎን ለመመዝገብ ከታች ያለውን የQR ኮድ ስካን ያድርጉ

source: Today's Visitors
am_et: የዛሬ ጎብኝዎች

source: Total Visitors
am_et: ጠቅላላ ጎብኝዎች

source: Please Take a Moment for Self-Registration, Check-In or Check-Out Below
am_et: እባክዎ ራስዎን ለመመዝገብ፣ መግቢያ ፍቃድዎን ለማረጋገጥ ወይንም ሥለነበረዎት ቆይታ አስተያየት ለመስጠት ከታች ያለውን ምልክት ይጠቀሙ!

source: More Info
am_et: ተጨማሪ መረጃ

source: Rejected Requests
am_et: ውድቅ የተደረጉ ጥያቄዎች

source: All Requests
am_et: ሁሉም ጥያቄዎች

source: rejectedRequests
am_et: ውድቅ የተደረጉ ጥያቄዎች

source: Visitor Requests
am_et: የጎብኚዎች ጥያቄዎች

source: Welcome to
am_et: እንኳን በደህና መጡ ወደ

source: Self-Registration
am_et: መመዝገቢያ

source: Check-In
am_et: መግቢያ

source: Check-Out
am_et: መውጫ

source: Approved Requests
am_et: የጸደቁ ጥያቄዎች

source: Pending Requests
am_et: በመጠባበቅ ላይ ያሉ ጥያቄዎች

source: Departments
am_et: ክፍሎች

source: Welcome-to
am_et: እንኳን ወደ

source: Wel-come
am_et: በደህና መጡ
