Repository: fikre211/visitor-management-system-main
Catalog: GatePass.*.ClientApp/Resources/Views/Home/SelectCompany.*.resx
Languages: am_et

source: Visitor Management Portal
am_et: ቪዚተር ማናጅመንት ፖርታል

source: Visitor Management System
am_et: ቪሲተር ማናጅመንት ሲስተም

source: Home
am_et: መነሻ

source: Features
am_et: ባህሪያት

source: Contact
am_et: አግኙን

source: About
am_et: ስለ እኛ

source: Help
am_et: እርዳታ

source: Welcome to Ethiopian Government Offices Visitors Portal!
am_et: እንኳን ወደ የኢትዮጵያ መንግስት ቢሮዎች ቪዚተር ማናጅመንት ፖርታል በደህና መጡ!

source: Powered by Ministry of Innovation and Technology (MInT)
am_et: በኢትዮጵያ ኢኖቬሽን እና ቴክኖሎጅ ሚንስቴር የተደገፈ

source: Streamlined Guest Registration, Check-In & Check-Out processes for a better visitor experience!
am_et: ቀላል እና ፈጣን መመዝገቢያ፣ መግቢያ & መውጫ

source: Get Started
am_et: ጀምር

source: Visitor Management System Overview
am_et: የጎብኚ አስተዳደር ስርዓት አጠቃላይ እይታ

source: Total Companies
am_et: ጠቅላላ ኩባንያዎች

source: Today's Visits
am_et: የዛሬ ጉብኝቶች

source: All-Time Visits
am_et: ጠቅላላ ጉብኝቶች

source: Select Your Destination
am_et: መድረሻዎን ይምረጡ

source: Choose the organization you're visiting today
am_et: ዛሬ የምትጎብኙትን ድርጅት ይምረጡ

source: About Our System
am_et: ስለ ስርዓታችን

source: Modern solution for visitor management
am_et: ዘመናዊ መፍትሄ ለጎብኚ አስተዳደር

source: Why Choose Our System?
am_et: ለምን ስርዓታችንን ይመርጣሉ?

# Quick and easy Registration, Check-In &amp; Check-Out
source: Quick and easy Registration, Check-In & Check-Out
am_et: ቀላል እና ፈጣን መመዝገብ፣ መግቢያ & መውጫ

source: Instant host notifications
am_et: ወዲያውኑ ለተቀባይ ማሳወቂያዎች

source: Customizable to your brand
am_et: በእርስዎ ድርጂት ልክ የሚስተካከል

source: Comprehensive visitor analytics
am_et: የጎብኚ አስተዳደር ዝርዝር ትንታኔ

source: Key Features
am_et: ዋና ባህሪያት

source: Fast Check-in
am_et: ፈጣን መግቢያ

source: Enhanced Security
am_et: የተሻሻለ ደህንነት

source: Instant Notifications
am_et: ወዲያውኑ ማሳወቂያዎች

source: Detailed Analytics
am_et: ዝርዝር ትንታኔ

source: What Our Clients Say
am_et: ደንበኞቻችን የሚሉት

source: Testimonials from businesses using our visitor management system
am_et: የእኛን የጎብኚ አስተዳደር ስርዓት የሚጠቀሙ የንግድ እውቅናዎች

source: Get in Touch
am_et: ያግኙን

source: Have questions? Contact our support team
am_et: ጥያቄ አለዎት? የድጋፍ ቡድናችንን ያግኙ

source: Name
am_et: ስም

source: Your Name
am_et: የእርስዎ ስም

source: Email
am_et: ኢሜይል

source: Your Email
am_et: የእርስዎ ኢሜይል

source: Message
am_et: መልእክት

source: Your Message
am_et: መልእክትዎን ይጻፉ

source: Send Message
am_et: መልእክት ይላኩ

source: Address
am_et: አድራሻ

source: Near Lycee Gebremariam School
am_et: ከሊሴ ገብረ ማሪያም ትምህርት ቤት አቅራቢያ

source: Arada Sub-City
am_et: አራዳ ክፍለ ከተማ

source: Addis Ababa, Ethiopia
am_et: አዲስ አበባ፣ ኢትዮጵያ

source: Phone
am_et: ስልክ

source: Connect With Us
am_et: ከእኛ ጋር ይገናኙ

source: Transforming the visitor experience
am_et: የጎብኚ ተሞክሮን በመለወጥ

source: Quick Links
am_et: ፈጣን አገናኞች

source: Terms
am_et: ውሎች

source: Privacy
am_et: ግላዊነት

source: Support
am_et: ድጋፍ
